package com.java.testdriven.chapter04;

/**
 * 	代码重构
 * 
 * 
 * 	代码重构指的是对既有代码的结构进行修改，同时不改变其外部行为。
 * 	
 * 	重构旨在改进既有代码，这样做的原因很多：提高可读性、降低复杂度、使其更易于维护或更容易扩展等。
 * 
 * 	不管重构的原因是什么，其终极目标都是改进代码的某个方面，从而降低技术债务：减少因设计、架构或编码不佳而需要做的额外工作。
 *	
 *	通常，我们在不改变行为的情况下做一系列细微的修改以实现重构。
 *	通过缩小修改范围，我们可始终确认所做的修改没有破坏既有功能。
 *	而要获得这样的确认，唯一有效的办法是使用自动化测试。
 *
 *	单元测试的一大优点是，为重构提供最有力的支持。
 *	如果没有自动化测试确认应用程序依然像期望的那样工作，重构将风险重重。
 *	虽然任何类型的测试都可用于提供重构所需的代码覆盖率，但大多数情况下，只有单元测试能够达到要求的细致程度。
 *
 *	@author hzweiyongqiang
 */
public class Course13CodeRefactor {

}
