package com.java.testdriven.chapter07;

/**
 * 	文档
 * 
 * 
 * 	管理层通常认为文档与项目成败有一定关系，如果没有大量（通常是短命的）文档，项目就会失败。
 * 	因此，大家被要求花大量时间进行规划、回答问题以及填写问卷，而这些问卷的设计常常对项目毫无帮助，却旨在营造“一切尽在掌握”的假象。
 * 	有些职位就是为文档而存在的——这个文档就是我的工作成果。
 * 	文档还被作为安慰剂，让人觉得一切都在按计划进行——有Excel表指出了这一点。
 * 	然而，创建文档最常见的原因是，有规章制度要求必须创建某些文档；即便你怀疑这些文档的价值，但规章制度神圣不可侵犯，你必须创建。
 * 
 * 	文档不仅可能以错误的目的创建，从而不能提供足够的价值，而且常常可能有巨大的破坏力。
 * 	既然创建了文档，自然要信任它，可如果文档不是最新的，结果将如何呢？
 *	
 *	只要时间足够长，所有传统文档都将过时。
 *	如果我们完全信任不准确的东西，开发工作基于的假设就将是错误的。
 *
 *	唯一准确的文档是我们编写的代码。
 *	代码是我们开发的，也是我们部署的，只有它们才能完全准确反映应用程序。
 *
 *	@author hzweiyongqiang
 */
public class Course11Documentation {

}
