package com.java.testdriven.chapter07;

/**
 * 	供程序员使用的文档
 * 
 * 	
 * 	我们不仅不断使用规范以验证代码，它们还是可执行的文档。
 * 	规范总是最新的，否则它们执行时就会失败。
 * 	另外，虽然代码应该编写得易于阅读和理解，但帮助理解某段实现代码的编写原因、逻辑和动机方面，规范提供了更容易的捷径。
 *	
 *	将代码作为文档并不排斥其他类型的文档。
 *	恰恰相反，关键不是避免使用静态文档，而是避免重复。
 *	代码提供了必要的细节时，优先查看代码而不是其他文档；
 *	大多数情况下，其他文档指的是较简略的文档，如概述、系统的总体目标、使用的技术、环境搭建、安装、构建、打包以及其他类型的数据。
 *	它们不提供详细信息，更像是指南和快速入门。
 *
 *	对于这些文档，markdown格式（http://whatismarkdown.com/）的简单README文件通常是最佳的。
 *	@author hzweiyongqiang
 */
public class Course12DocForCoders {

}
