package com.java.testdriven.chapter07;

/**
 * 	行为驱动开发（Behavior-driven development）
 *	
 *
 *	BDD是一种敏捷过程，旨在项目开发过程中始终专注于相关方的利益。
 *	这是一个TDD变种，它也预先定义规范，根据规范完成实现并定期运行规范以验证结果。
 *	
 *	不像TDD那样基于单元测试，BDD倡导编写多个规范（称为场景）再开始实现（编码）。
 *	虽然没有具体的规则，但BDD通常偏重于简约的功能需求。
 *
 *	BDD适用于所有人——程序员、测试人员、管理人员、最终用户、业务代表等。
 *
 *	TDD基于单元层级，可以说是从内到外的（从单元开始，逐步延伸到功能）
 *	BDD通常被认为是从外到内的（从功能着手，往内逐步延伸到单元）。
 *
 *	行为驱动开发扮演的是验收标准和就绪程度指示器的角色，指出产品何时完工并可部署到生产环境。
 *	
 *	我们首先定义功能（或行为），再使用TDD和单元测试实现；实现完整的行为后，再使用BDD验证。
 *
 *	TDD是针对程序员的，周期非常短；而BDD针对所有人，周期要长得多。
 *	对于每个BDD场景，都有大量TDD单元测试。
 *
 *	@author hzweiyongqiang
 */
public class Course20BehaviorDriven {

}
