package com.java.testdriven.chapter02;

/**
 * 	行为驱动开发（Behavior-driven development）
 *	
 *	行为驱动开发（BDD）是一种敏捷过程，旨在整个项目开发过程中都专注于相关方的利益。
 *	
 *	BDD基于这样的前提，即需求必须以所有人（业务代表、分析师、开发人员、测试人员、项目经理等）都能看懂的方式编写。
 *	这里的关键是提供一组人人都能理解并使用的独特工件——一系列用户故事。
 *	这些故事由整个团队编写，并被用作需求和可执行的测试用例。
 *	这是一种TDD实施方式，但具有单元测试无法比拟的清晰度；这还是一种描述和测试功能的方式，其中的测试几乎完全是使用自然语言编写的，但既是可运行的，又是可重复的。
 *
 *	故事由场景组成，而每个场景都是使用自然语言编写的，表示一个简洁的用例，由不同步骤组成。
 *	步骤按顺序排列，定义了场景的前置条件、事件和结果。
 *	每个步骤都以单词Given、When或Then打头，其中Given用于指定前置条件，When用于指定操作，而Then用于执行验证。
 *
 *	@author hzweiyongqiang
 */
public class Course100BehaviorDrivenDev {

}
