package com.java.testdriven.chapter01;

/**
 * 	更好的测试
 *	
 *	需求（规范和用户故事）是在实现需求的代码之前编写的，因此是它们定义了代码，而不是相反。对测试来说亦如此。
 *	如果它们是在代码之后编写的，那么从某种意义上说，是代码（及其实现的功能）定义了测试。
 *
 *	由既有应用程序定义的测试有失偏颇，倾向于确认代码的功能，而不是检查客户的期望是否得到满足，或者说代码的行为是否符合预期。
 *	
 *	如果是手动测试，这种倾向可能不那么严重，因为手动测试通常由独立的QC（即使通常称为QA）部门来做。
 *	这种部门以独立于开发人员的方式定义测试，这将导致更严重的问题，因为必然会出现部门间沟通不畅和“警察综合征”的问题。
 *	所谓“警察综合征”是指，测试人员不力图去帮助开发团队编写有质量保证的应用程序，而只会在流程结束后找茬。
 *	问题发现得越早，为修复而付出的代价越低。
 *
 *
 *	以TDD（包括其ATDD和BDD等变种）编写的测试旨在未雨绸缪，将问题消灭在萌芽状态，确保开发的应用程序从根本上有质量保证。
 *
 *	@author hzweiyongqiang
 */
public class Course24BetterTests {

}
